app/controllers/child_updates_controller.rb

def show_note
	@record = ChildUpdate.find(:first, :conditions=> ['id=?',params[:id]])
---
SELECT * FROM `child_updates` WHERE (id='2') LIMIT 1